'''
4) Даны целые положительные числа A и B (A > B). На отрезке длины A размещено максимально возможное количество отрезков
длины B (без наложений). Используя операцию деления нацело, найти количество отрезков B, размещенных на отрезке AB.
'''

print(f"количество отрезков B, размещенных на отрезке AB = {int(input('Введите число A: ')) // int(input('Введите число B: '))}")
